print('+ — сложение, - — минусование), * — умножение, / — деление')

while True:
    a = int(input('Введите первое число : '))
    znk = input('Введите знак : ')
    if znk != "+" and znk != "-" and znk != "*" and znk != "/":
        print('Вы невнемательны поставте ЗНАК')
        continue
    b = int(input('Введите втоое число : '))  
    if znk == '+':
        print(a,"+",b,'=',a + b)
        print('..........................................................')
        continue
    if znk == '-':
        print(a,"-",b,'=',a - b)
        print('..........................................................')
        continue
    if znk == '*':
        print(a,"*",b,'=',a * b)
        print('..........................................................')
        continue
    if znk == '/':
        if a % b == 0:
            print(a,"/",b,'=',int(a / b))
        else:
            print(a,"/",b,'=',a / b)
        print('..........................................................')
        continue